app/Http/Controllers/TaskController.php

    public function index(Request $request)
    {
        $search = $request->input('search');
        $tasksPerPage = 2;

        $query = Task::query();

        if ($search) {
            $query->where('name', 'LIKE', '%' . $search . '%')
                  ->orWhere('description', 'LIKE', '%' . $search . '%');
        }

        $tasks = $query->paginate($tasksPerPage);
---
select * from `tasks` where `name` LIKE '%huss%' or `description` LIKE '%huss%' limit 2 offset 0
select count(*) as aggregate from `tasks` where `name` LIKE '%huss%' or `description` LIKE '%huss%'