app/Http/Controllers/TaskController.php

    public function index(Request $request)
    {
        $search = $request->input('search');
        $tasksPerPage = 2;

        $query = Task::query();

        if ($search) {
            $query->where('name', 'LIKE', '%' . $search . '%')
                ->orWhere('description', 'LIKE', '%' . $search . '%');
        }

        $tasks = $query->paginate($tasksPerPage);
---
select * from `tasks` where `name` LIKE '%k%' or `description` LIKE '%k%' limit 2 offset 0
select count(*) as aggregate from `tasks` where `name` LIKE '%k%' or `description` LIKE '%k%'

    public function store(FormTaskRequest $request, Task $task)
    {

     // 1. Validation
     $validatedData = $request->validated();

     // 2. Create the Task
     $task->create($validatedData);
---
insert into `tasks` (`name`, `description`, `updated_at`, `created_at`) values ('yasmine', '<p>boooom</p>', '2023-12-01 14:37:45', '2023-12-01 14:37:45')